public/man/man1/pw-metadata.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - pw-metadata.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - pw-metadata.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>pw-metadata - The PipeWire metadata</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>pw-metadata</strong> [/options/] [/id/ [/key/ [/value/ [/type/ ] ] ] ]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Monitor, set and delete metadata on PipeWire objects.</p>
<p>
Metadata are key/type/value triplets attached to objects identified by
<em>id</em>. The metadata is shared between all applications binding to the
same metadata object. When an object is destroyed, all its metadata is
automatically removed.</p>
<p>
When no <em>value</em> is given, <strong>pw-metadata</strong> will query and log the metadata
matching the optional arguments <em>id</em> and <em>key</em>. Without any arguments,
all metadata is displayed.</p>
<p>
When <em>value</em> is given, <strong>pw-metadata</strong> will set the metadata for <em>id</em> and
<em>key</em> to <em>value</em> and an optional <em>type</em>.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p><strong>-r | –remote=NAME</strong></p>
<blockquote>
<p>The name the remote instance to use. If left unspecified, a connection
is made to the default PipeWire instance.</p>
</blockquote>
<p>
<strong>-h | –help</strong></p>
<blockquote>
<p>Show help.</p>
</blockquote>
<p>
<strong>–version</strong></p>
<blockquote>
<p>Show version information.</p>
</blockquote>
<p>
<strong>-l | –list</strong></p>
<blockquote>
<p>List available metadata objects</p>
</blockquote>
<p>
<strong>-m | –monitor</strong></p>
<blockquote>
<p>Keeps running and log the changes to the metadata.</p>
</blockquote>
<p>
<strong>-d | –delete</strong></p>
<blockquote>
<p>Delete all metadata for <em>id</em> or for the specified <em>key</em> of object <em>id</em>.
Without any option, all metadata is removed.</p>
</blockquote>
<p>
<strong>-n | –name</strong></p>
<blockquote>
<p>Metadata name (Default: &#39;default&#39;).</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
EXAMPLES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p><strong>pw-metadata</strong></p>
<p>
Show metadata in default name.</p>
<p>
<strong>pw-metadata</strong> -n settings 0</p>
<p>
Display settings.</p>
<p>
<strong>pw-metadata</strong> -n settings 0 clock.quantum 1024</p>
<p>
Change clock.quantum to 1024.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
AUTHORS
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>The PipeWire Developers
&lt;<a href="https://gitlab.freedesktop.org/pipewire/pipewire/issues">https://gitlab.freedesktop.org/pipewire/pipewire/issues</a>&gt;; PipeWire is
available from &lt;<a href="https://pipewire.org">https://pipewire.org</a>&gt;</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
SEE ALSO
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p><strong>pipewire(1)</strong>, <strong>pw-mon(1)</strong>, <strong>pw-cli(1)</strong>,</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
